# SQLİTE ÖDEVİ

## SQL ALIŞTIRMALARI 1

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///vbo.db

In [3]:
%%sql
SELECT name FROM sqlite_master WHERE type = "table";

 * sqlite:///vbo.db
Done.

[('Categories',),
 ('Customers',),
 ('Employees',),
 ('OrderDetails',),
 ('Orders',),
 ('Products',),
 ('Shippers',),
 ('Suppliers',)]

# 1. Orders tablosunda kaç müşteri oldugunu bulunuz.

In [4]:
%%sql
SELECT COUNT(CustomerID) FROM Orders;

 * sqlite:///vbo.db
Done.

[(196,)]

## 2. Orders tablosunda kaç tane eşsiz müşteri olduğunu bulunuz.

In [5]:
%%sql
SELECT COUNT(DISTINCT CustomerID) FROM Orders;

 * sqlite:///vbo.db
Done.

[(74,)]

## 3. Customers tablosunda hangi ülkeden kaçar tane müşteri olduğunu bulunuz.

In [6]:
%%sql
SELECT COUNT(CustomerID) AS müşteri_sayısı, Country FROM Customers GROUP BY Country ORDER BY müşteri_sayısı DESC LIMIT 10;

 * sqlite:///vbo.db
Done.

[(13, 'USA'),
 (11, 'Germany'),
 (11, 'France'),
 (9, 'Brazil'),
 (7, 'UK'),
 (5, 'Spain'),
 (5, 'Mexico'),
 (4, 'Venezuela'),
 (3, 'Italy'),
 (3, 'Canada')]

## 4. Müşterilerin ülkesi Brazil ya da USA olanlarını bulunuz.

In [7]:
%%sql
SELECT * FROM Customers WHERE Customers.Country = "Brazil" OR Customers.Country = "USA" LIMIT 10;

 * sqlite:///vbo.db
Done.

[(15, 'Comércio Mineiro', 'Pedro Afonso', 'Av. dos Lusíadas, 23', 'São Paulo', '05432-043', 'Brazil'),
 (21, 'Familia Arquibaldo', 'Aria Cruz', 'Rua Orós, 92', 'São Paulo', '05442-030', 'Brazil'),
 (31, 'Gourmet Lanchonetes', 'André Fonseca', 'Av. Brasil, 442', 'Campinas', '04876-786', 'Brazil'),
 (32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA'),
 (34, 'Hanari Carnes', 'Mario Pontes', 'Rua do Paço, 67', 'Rio de Janeiro', '05454-876', 'Brazil'),
 (36, 'Hungry Coyote Import Store', 'Yoshi Latimer', 'City Center Plaza 516 Main St.', 'Elgin', '97827', 'USA'),
 (43, 'Lazy K Kountry Store', 'John Steel', '12 Orchestra Terrace', 'Walla Walla', '99362', 'USA'),
 (45, "Let's Stop N Shop", 'Jaime Yorres', '87 Polk St. Suite 5', 'San Francisco', '94117', 'USA'),
 (48, 'Lonesome Pine Restaurant', 'Fran Wilson', '89 Chiaroscuro Rd.', 'Portland', '97219', 'USA'),
 (55, 'Old World Delicatessen', 'Rene Phillips', '2743 Bering St.', 'Anchorage', '99508', 'USA')]

## 5. Önce ülkeye sonra şehre göre group by işlemi yapıp bu kırılımda müşteri sayısını bulunuz.

In [8]:
%%sql
SELECT COUNT(CustomerID) as müşteri_sayısı, Country, City FROM Customers GROUP BY Country, City ORDER BY müşteri_sayısı DESC LIMIT 10;

 * sqlite:///vbo.db
Done.

[(6, 'UK', 'London'),
 (5, 'Mexico', 'México D.F.'),
 (4, 'Brazil', 'São Paulo'),
 (3, 'Argentina', 'Buenos Aires'),
 (3, 'Brazil', 'Rio de Janeiro'),
 (3, 'Spain', 'Madrid'),
 (2, 'France', 'Nantes'),
 (2, 'France', 'Paris'),
 (2, 'Portugal', 'Lisboa'),
 (2, 'USA', 'Portland')]

# SQL ALIŞTIRMALARI II

## 6. Müşterileri adreslerinin herhangi bir yerinde "da" ifadesi geçen tüm adresleri bulunuz.

In [9]:
%%sql
SELECT * FROM Customers WHERE Address LIKE '%da%' LIMIT 10;

 * sqlite:///vbo.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (13, 'Centro comercial Moctezuma', 'Francisco Chang', 'Sierras de Granada 9993', 'México D.F.', '5022', 'Mexico'),
 (15, 'Comércio Mineiro', 'Pedro Afonso', 'Av. dos Lusíadas, 23', 'São Paulo', '05432-043', 'Brazil'),
 (28, 'Furia Bacalhau e Frutos do Mar', 'Lino Rodriguez', 'Jardim das rosas n. 32', 'Lisboa', '1675', 'Portugal'),
 (54, 'Océano Atlántico Ltda.', 'Yvonne Moncada', 'Ing. Gustavo Moncada 8585 Piso 20-A', 'Buenos Aires', '1010', 'Argentina'),
 (60, 'Princesa Isabel Vinhoss', 'Isabel de Castro', 'Estrada da saúde n. 58', 'Lisboa', '1756', 'Portugal'),
 (61, 'Que Delícia', 'Bernardo Batista', 'Rua da Panificadora, 12', 'Rio de Janeiro', '02389-673', 'Brazil'),
 (62, 'Queen Cozinha', 'Lúcia Carvalho', 'Alameda dos Canàrios, 891', 'São Paulo', '05487-020', 'Brazil'),
 (66, 'Reggiani Caseifici', 'Maurizio Moroni', 'Strada Provinciale 124', 'Reggio Emilia', '42100', 'Italy'),
 (80, 'Tortuga Restaurante', 'Miguel Angel Paolino', 'Avda. Azteca 123', 'México D.F.', '5033', 'Mexico')]

## 7. Germany-Berlin'de yaşayan müşteri/müşterilerin isimleri nelerdir?

In [10]:
%%sql
SELECT Customers.CustomerName FROM Customers WHERE Customers.Country = "Germany" AND Customers.City = "Berlin";

 * sqlite:///vbo.db
Done.

[('Alfreds Futterkiste',)]

## 8. Canada'da yaşayıp isimlerinde "in" ifadesi geçen müşteri/müşterileri bulunuz.

In [11]:
%%sql
SELECT * FROM Customers WHERE (Customers.Country = "Canada") AND CustomerName LIKE "%in%";

 * sqlite:///vbo.db
Done.

[(42, 'Laughing Bacchus Wine Cellars', 'Yoshi Tannamuri', '1900 Oak St.', 'Vancouver', 'V3F 2K1', 'Canada')]

## 9. Fiyatı 40 TL ile 90 TL arasında olan ürünlerin isimleri ve fiyatları nelerdir?

In [12]:
%%sql
SELECT Products.ProductName, Products.Price FROM Products WHERE Price BETWEEN 40 AND 90 LIMIT 10;

 * sqlite:///vbo.db
Done.

[('Northwoods Cranberry Sauce', 40),
 ('Genen Shouyu', 43),
 ('Carnarvon Tigers', 62),
 ('Teatime Chocolate Biscuits', 43),
 ("Sir Rodney's Marmalade", 81),
 ('Guaraná Fantástica', 43),
 ('Schoggi Schokolade', 43),
 ('Rössle Sauerkraut', 45),
 ('Geitost', 43),
 ('Boston Crab Meat', 43)]

## 10. Fiyatı 30 TL'den büyük olan ürünlerin isimlerini, fiyatlarini ve fiyatlarinin karesini bulunuz ve tüm değişkenlerin isimlendirmelerini aşağıdaki şekilde yapınız:

urun ismi, urun_fiyati, ürün_fiyatinin_karesi

In [13]:
%%sql
SELECT Products.ProductName AS urun_ismi, Products.Price AS urun_fiyati, Price * Price AS ürün_fiyatinin_karesi FROM Products WHERE Products.Price > 30 LIMIT 10;

 * sqlite:///vbo.db
Done.

[('Northwoods Cranberry Sauce', 40, 1600),
 ('Mishi Kobe Niku', 97, 9409),
 ('Ikura', 31, 961),
 ('Queso Manchego La Pastora', 38, 1444),
 ('Genen Shouyu', 43, 1849),
 ('Alice Mutton', 39, 1521),
 ('Carnarvon Tigers', 62, 3844),
 ('Teatime Chocolate Biscuits', 43, 1849),
 ("Sir Rodney's Marmalade", 81, 6561),
 ('Guaraná Fantástica', 43, 1849)]

# SQL ALIŞTIRMALARI III

## 11. Products tablosundaki CategoryID’lerin yani kategorilerin isimleri nelerdir?

In [14]:
%%sql
SELECT * FROM Products LEFT JOIN Categories on Products.CategoryID = Categories.CategoryID LIMIT 10;

 * sqlite:///vbo.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18, 1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19, 1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30, 7, 'Produce', 'Dried fruit and bean curd'),
 (8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97, 6, 'Meat/Poultry', 'Prepared meats'),
 (10, 'Ikura', 4, 8, '12 - 200 ml jars', 31, 8, 'Seafood', 'Seaweed and fish')]

## 12. beverages ürün kategorisindeki ürünlerin fiyat ortalaması nedir?
BU SORUYA BİR BAK

In [15]:
%%sql
SELECT AVG(Price) FROM  Products LEFT OUTER JOIN Categories ON Products.CategoryID = Categories.CategoryID WHERE CategoryName = "Beverages" ;

 * sqlite:///vbo.db
Done.

[(42.75,)]

## 13. USA'de yaşayan müşterilerin kazandırdığı toplam kazancı bulunuz.

In [16]:
%%sql 
SELECT SUM(Price)
FROM Orders LEFT OUTER JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
LEFT OUTER JOIN Products ON OrderDetails.ProductID = Products.ProductID
LEFT OUTER JOIN Customers ON Orders.CustomerID = Customers.CustomerID WHERE Customers.Country = "USA" LIMIT 5;

 * sqlite:///vbo.db
Done.

[(3762,)]

## 14. Products tablosundaki CategoryID'lerin isimlerini bulunuz ve sonrasında kategori başına ortalama ürün fiyatını gösteriniz.

In [17]:
%%sql
SELECT Products.CategoryID, Categories.CategoryName, AVG(Price) FROM Products LEFT OUTER JOIN Categories ON Categories.CategoryID = Products.CategoryID GROUP BY CategoryName;

 * sqlite:///vbo.db
Done.

[(1, 'Beverages', 42.75),
 (2, 'Condiments', 28.25),
 (3, 'Confections', 33.76923076923077),
 (4, 'Dairy Products', 74.9),
 (5, 'Grains/Cereals', 23.571428571428573),
 (6, 'Meat/Poultry', 55.166666666666664),
 (7, 'Produce', 32.2),
 (8, 'Seafood', 26.5)]

## 15. Çalışanları (EmployeeID) isimleri ile birlikte yaptıkları toplam satışlara göre sıralayınız.

In [18]:
%%sql 
SELECT Employees.FirstName, Employees.LastName, SUM(Products.Price) toplam_satıs 
FROM Orders LEFT OUTER JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
LEFT OUTER JOIN Products ON OrderDetails.ProductID = Products.ProductID
LEFT OUTER JOIN Employees ON Employees.EmployeeID = Orders.EmployeeID 
GROUP BY Orders.EmployeeID ORDER BY toplam_satıs DESC LIMIT 10;

 * sqlite:///vbo.db
Done.

[('Margaret', 'Peacock', 5515),
 ('Nancy', 'Davolio', 4353),
 ('Janet', 'Leverling', 3048),
 ('Michael', 'Suyama', 2981),
 ('Laura', 'Callahan', 2380),
 ('Robert', 'King', 1852),
 ('Andrew', 'Fuller', 1550),
 ('Steven', 'Buchanan', 1408),
 ('Anne', 'Dodsworth', 520)]

# SQL ALIŞTIRMALARI IV

## 16. Germany'dan verilen siparişlerin kategorilerine göre ortalama fiyatları nelerdir?

In [19]:
%%sql 
SELECT Products.CategoryID, Categories.CategoryName, AVG(Products.Price)
FROM Orders LEFT OUTER JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
LEFT OUTER JOIN Products ON OrderDetails.ProductID = Products.ProductID
LEFT OUTER JOIN Categories ON Categories.CategoryID = Products.CategoryID
LEFT OUTER JOIN Customers ON Orders.CustomerID = Customers.CustomerID
WHERE Customers.Country = "Germany" GROUP BY CategoryName;

 * sqlite:///vbo.db
Done.

[(1, 'Beverages', 20.5),
 (2, 'Condiments', 34.0),
 (3, 'Confections', 40.0),
 (4, 'Dairy Products', 151.64705882352942),
 (5, 'Grains/Cereals', 22.142857142857142),
 (6, 'Meat/Poultry', 30.2),
 (7, 'Produce', 30.75),
 (8, 'Seafood', 27.09090909090909)]

## 17. Almanya ya da USA'den verilen siparişlerin kategorilerine göre ortalama fiyatları nelerdir?

In [20]:
%%sql 
SELECT Products.CategoryID, Categories.CategoryName, Customers.Country, AVG(Products.Price)
FROM Orders LEFT OUTER JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
LEFT OUTER JOIN Products ON OrderDetails.ProductID = Products.ProductID
LEFT OUTER JOIN Categories ON Categories.CategoryID = Products.CategoryID
LEFT OUTER JOIN Customers ON Orders.CustomerID = Customers.CustomerID
WHERE (Customers.Country = "Germany") OR (Customers.Country = "USA") GROUP BY CategoryName;

 * sqlite:///vbo.db
Done.

[(1, 'Beverages', 'USA', 29.88888888888889),
 (2, 'Condiments', 'USA', 34.72727272727273),
 (3, 'Confections', 'USA', 39.92307692307692),
 (4, 'Dairy Products', 'Germany', 131.75862068965517),
 (5, 'Grains/Cereals', 'USA', 29.846153846153847),
 (6, 'Meat/Poultry', 'Germany', 46.75),
 (7, 'Produce', 'USA', 28.625),
 (8, 'Seafood', 'USA', 25.6)]

## 18. Haziran Temmuz Ağustos aylarında verilen siparişlerin ortalama fiyatı nedir?

In [21]:
%%sql
SELECT AVG(Price)
FROM Orders LEFT OUTER JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
LEFT OUTER JOIN Products ON OrderDetails.ProductID = Products.ProductID
WHERE OrderDate LIKE "%06%" OR OrderDate LIKE "%07%" OR OrderDate LIKE "%08%";

 * sqlite:///vbo.db
Done.

[(42.4765625,)]

## 19. Müşterilerin 1997 yılına ait siparişlerinin maksimum miktarlarını bulup müşterilerin isimleri ile birlikte büyükten küçüğe sıralayınız.

In [22]:
%%sql
SELECT Customers.CustomerName, MAX(Price)
FROM Orders LEFT OUTER JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
LEFT OUTER JOIN Products ON OrderDetails.ProductID = Products.ProductID
LEFT OUTER JOIN Customers ON Orders.CustomerID = Customers.CustomerID
WHERE OrderDate LIKE '%1997' GROUP BY CustomerName ORDER BY MAX(Price) DESC LIMIT 10;

 * sqlite:///vbo.db
Done.

[('Gourmet Lanchonetes', 435),
 ('Simons bistro', 263),
 ('Mère Paillarde', 263),
 ('Save-a-lot Markets', 123),
 ('Eastern Connection', 123),
 ('Wellington Importadora', 97),
 ('Ernst Handel', 55),
 ('Bottom-Dollar Marketse', 55),
 ("La maison d'Asie", 49),
 ('Folies gourmandes', 49)]

## 20. Sipariş yılı 1997 olan siparişleri alan çalışanları sipariş alma sayılarına göre sıralayınız.

In [23]:
%%sql
SELECT  COUNT(*) ,FirstName, LastName
FROM Orders LEFT OUTER JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID
WHERE OrderDate LIKE '%1997' GROUP BY FirstName ORDER BY  COUNT(*) DESC LIMIT 10;

 * sqlite:///vbo.db
Done.

[(13, 'Janet', 'Leverling'),
 (9, 'Margaret', 'Peacock'),
 (8, 'Laura', 'Callahan'),
 (4, 'Andrew', 'Fuller'),
 (3, 'Robert', 'King'),
 (3, 'Nancy', 'Davolio'),
 (3, 'Michael', 'Suyama'),
 (1, 'Anne', 'Dodsworth')]